src/test/java/soap/consultas/request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:con="http://epm.com.co/aguas/hidro/contratoservicios" xmlns:con1="http://epm.com.co/aguas/hidro/contratodatos" >
    <soap:Header/>
    <soap:Body>
        <con:ConsultarInformacionDireccion>
            <!--Optional:-->
            <con:parametros>
                <!--Optional:-->
                <con1:Empresa>
                    <con1:IdEmpresa>1</con1:IdEmpresa>
                </con1:Empresa>
                <con1:Direccion>CL 39 CR 90 -40</con1:Direccion>
                <con1:GeometriaDireccion><![CDATA[<?xml version="1.0" encoding="utf-16"?>
<SdoGeometry xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <Point>
    <X>-75.6104383</X>
    <Y>6.25038138</Y>
    <Z xsi:nil="true" />
  </Point>
  <Sdo_Gtype>2001</Sdo_Gtype>
  <Sdo_Srid>4326</Sdo_Srid>
</SdoGeometry>]]></con1:GeometriaDireccion>
                <!--Optional:-->
                <con1:IdCiudad>1037</con1:IdCiudad>
                <con1:PorDescargue>true</con1:PorDescargue>
                <!--Optional:-->
                <con1:RadioConsulta>200</con1:RadioConsulta>
            </con:parametros>
        </con:ConsultarInformacionDireccion>
    </soap:Body>
</soap:Envelope>